backbone:
  - [-1, 1, Conv, [64, 3, 1]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512]]
  - [-1, 1, Conv, [768, 3, 2]]
  - [-1, 3, C2f, [768]]
  - [-1, 1, SPPF, [768]]

neck:
  - [-1, 1, Conv, [384, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [384]]
  - [-1, 1, Conv, [192, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [192]]
  - [-1, 1, Conv, [192, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [384]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [768]]

head:
  type: RTDETR
  args:
    num_classes: 10
    in_channels: [192, 384, 768]
    num_queries: 100
